aaron-bond.better-comments
charliermarsh.ruff
donjayamanne.python-environment-manager
esbenp.prettier-vscode
formulahendry.auto-rename-tag
matangover.mypy
mechatroner.rainbow-csv
ms-python.black-formatter
ms-python.debugpy
ms-python.isort
ms-python.pylint
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
pkief.material-icon-theme
qwtel.sqlite-viewer
